InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Тарифы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНормеЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовЗаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовЗаМесяц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/GkhInUaHbt/Ext/Module.bsl
Функция ЛицевойСчетПоGUID(УИД)
	Возврат Справочники.ЛицевыеСчета.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
КонецФункции

Функция ПриборУчетаПоGUID(УИД) 
	Возврат Справочники.ПриборыУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
КонецФункции

Функция ПустойОтвет()
	Результат = Новый ТаблицаЗначений();
	Результат.Добавить();
	Возврат Результат;
КонецФункции

Функция getState() Экспорт
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("STATE");
	Запись = Результат.Добавить();
	Запись.STATE = "ready";
	Возврат Результат;
КонецФункции
	
Функция getAccounts(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Представление КАК ACCOUNT_NUMB,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.КодКОАТУУ КАК LOCALITY_CODE,
		|	НЕОПРЕДЕЛЕНО КАК STREET_NAME,
		|	НЕОПРЕДЕЛЕНО КАК BUILDING_POST,
		|	ВЫБОР ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.КоличествоПодъездов
		|		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.КоличествоПодъездов
		|	КОНЕЦ КАК BUILDING_ENTR,
		|	ВЫБОР ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.КоличествоЭтажей                          
		|		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.КоличествоЭтажей
		|	КОНЕЦ КАК BUILDING_FLOO,
		|	НЕОПРЕДЕЛЕНО КАК BUILDING_NUMB,
		|	НЕОПРЕДЕЛЕНО КАК ADDRESS_NUMB,
		|	ВЫБОР ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.МногоКвартирный
		|		КОГДА ИСТИНА ТОГДА ""condominium""
		|		ИНАЧЕ ""private""
		|	КОНЕЦ КАК HABITATION_TYPE,
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.Представление, НЕОПРЕДЕЛЕНО) КАК DELEGATE_LAST,
		|	ВЫБОР ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ИНН
		|		КОГДА """" ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА "" "" ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ""-"" ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ИНН, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК DELEGATE_TAXID,
		|	ВЫБОР ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ДатаРождения
		|		КОГДА ДАТАВРЕМЯ(1, 1, 1) ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ДатаРождения, НЕОПРЕДЕЛЕНО) 
		|	КОНЕЦ КАК DELEGATE_BIRTH,
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Владелец.Представление КАК Адрес,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Представление КАК Квартира
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(, Действует" + Условие + ") КАК ЛицевыеСчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(, ИСТИНА" + Условие + ") КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Адрес = УправлениеКонтактнойИнформацией.РазложитьСтрокуНаПодстроки(Строка.Адрес, ",");
		Индекс = ?(Адрес[2] = " м.Миргород" ИЛИ Адрес[2] = " м. Миргород", Адрес[4], "");
		Улица  = Адрес[0];
		Дом    = Адрес[1];
		Строка.ACCOUNT_CODE  = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.STREET_NAME   = СокрЛП(Улица);
		Строка.BUILDING_POST = СокрЛП(СтрЗаменить(СтрЗаменить(Индекс, " ", ""), " ", ""));
		Если Строка.BUILDING_POST = "" Тогда
			Строка.BUILDING_POST = Неопределено;
		КонецЕсли;
		Строка.BUILDING_NUMB = СокрЛП(Сред(Дом, 7));
		Строка.ADDRESS_NUMB  = СокрЛП(Сред(Строка.Квартира, 6));
		Если Строка.ADDRESS_NUMB = "0" Или Строка.ADDRESS_NUMB = "" Тогда
			Строка.ADDRESS_NUMB = Неопределено;
		КонецЕсли;
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("Адрес");
	Результат.Колонки.Удалить("Квартира");
	Возврат Результат;
КонецФункции	

Функция getContacts(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	""05355"" КАК LOCALITY_PSTN,
	    |	""phone"" КАК CONTACT_TYPE,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.МобТелефон КАК CONTACT_DATA,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(, Действует" + Условие + ") КАК ЛицевыеСчетаСрезПоследних
	    |ГДЕ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.МобТелефон <> """"
	    |	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.МобТелефон <> ""0""
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО,
	    |	ВЫБОР ЛицевыеСчетаСрезПоследних.ЛицевойСчет.КодКОАТУУ
	    |		КОГДА ""5323280201"" ТОГДА ""05343""
	    |		КОГДА ""5323286001"" ТОГДА ""05346""
	    |		ИНАЧЕ ""05355""
	    |	КОНЕЦ,
	    |	НЕОПРЕДЕЛЕНО,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Телефон,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(, Действует" + Условие + ") КАК ЛицевыеСчетаСрезПоследних
	    |ГДЕ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Телефон <> """"
	    |	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Телефон <> ""0""";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.CONTACT_DATA = СокрЛП(Строка.CONTACT_DATA);
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции	

Функция getServices(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""water""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК INDUSTRY_TYPE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""water.sewerage""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Дополнительные) ТОГДА ""water.service""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК GROUP_TYPE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА
		|			ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ПУГарячаяВода
	    |				КОГДА ИСТИНА ТОГДА ""water.sewerage.hot""
	    |				ИНАЧЕ ""water.sewerage.cold""
	    |			КОНЕЦ
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Дополнительные) ТОГДА ""water.subsfee.total""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_TYPE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА 
	    |			ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ЕдиницаИзмерения.Наименование
	    |				КОГДА ""м3"" ТОГДА ""m3""
	    |				КОГДА ""грн"" ТОГДА ""s""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_UNIT,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(, Действует" + Условие + ") КАК НазначенныеУслугиСрезПоследних
		|ГДЕ
		|	НазначенныеУслугиСрезПоследних.Услуга.СпособНачисления В (
		|		ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета),
		|		ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления),
		|		ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ФиксированноеНачисление)
		|	)";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции

Функция getFeatures(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	""residentsNumber"" КАК FEATURE_TYPE,
	    |	""pp"" КАК FEATURE_UNIT,
	    |	ВЫБОР ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
		|		КОГДА 0 ТОГДА 1
		|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
		|	КОНЕЦ КАК FEATURE_VALUE,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(, Действует" + Условие + ") КАК ЛицевыеСчетаСрезПоследних";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции

Функция getRates(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА
		|			ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ПУГарячаяВода
	    |				КОГДА ИСТИНА ТОГДА ""water.sewerage.hot""
	    |				ИНАЧЕ ""water.sewerage.cold""
	    |			КОНЕЦ
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Дополнительные) ТОГДА ""water.subsfee.total""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_CODE,
		|	НЕОПРЕДЕЛЕНО КАК FEATURE_CODE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ВЫРАЗИТЬ(""service"" КАК СТРОКА(16))
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ВЫРАЗИТЬ(""service"" КАК СТРОКА(16))
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Дополнительные) ТОГДА ВЫРАЗИТЬ(""fixed"" КАК СТРОКА(16))
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК RATE_TYPE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА 
	    |			ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ЕдиницаИзмерения.Наименование
	    |				КОГДА ""м3"" ТОГДА ВЫРАЗИТЬ(""m3"" КАК СТРОКА(16))
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК RATE_UNIT,
	    |	НЕОПРЕДЕЛЕНО КАК RATE_VALUE,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
		|	НазначенныеУслугиСрезПоследних.Услуга КАК Услуга,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""residentsNumber""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""residentsNumber""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК Характеристика,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""pp""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""pp""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК ЕдИзмХарактеристики
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(, Действует" + Условие + ") КАК НазначенныеУслугиСрезПоследних
		|ГДЕ
		|	НазначенныеУслугиСрезПоследних.Услуга.СпособНачисления В (
		|		ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета),
		|		ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления),
		|		ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ФиксированноеНачисление)
		|	)";
	Результат = Запрос.Выполнить().Выгрузить();
	ЗапросТариф = Новый Запрос;
	ЗапросТариф.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР ТарифыСрезПоследних.ЗначениеТарифа
		|		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТарифыСрезПоследних.ЗначениеТарифа
		|	КОНЕЦ КАК RATE_VALUE,
		|	ВЫБОР ТарифыСрезПоследних.ЗначениеТарифаПоНорме
		|		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТарифыСрезПоследних.ЗначениеТарифаПоНорме
		|	КОНЕЦ КАК ТарифЗаЕдХарактеристики
		|ИЗ
		|	РегистрСведений.Тарифы.СрезПоследних(, Услуга = &Услуга И Здание = &Здание) КАК ТарифыСрезПоследних";
	Сч = Результат.Количество()-1;
	Пока Сч >= 0 Цикл
		Строка = Результат.Получить(Сч);
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		ЗапросТариф.УстановитьПараметр("Здание", Строка.Здание);
		ЗапросТариф.УстановитьПараметр("Услуга", Строка.Услуга);
		РезультатТариф = ЗапросТариф.Выполнить().Выгрузить();
		Для каждого СтрокаТариф из РезультатТариф Цикл
			Строка.RATE_VALUE = СтрокаТариф.RATE_VALUE;
			Если Строка.SERVICE_CODE <> "water.subsfee.total" Тогда
				Если СтрокаТариф.ТарифЗаЕдХарактеристики <> Неопределено Тогда
					НоваяСтрока = Результат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "ACCOUNT_CODE,PROVIDER_CODE,SERVICE_CODE");
					НоваяСтрока.FEATURE_CODE = Строка.Характеристика;
					НоваяСтрока.RATE_TYPE = "feature";
					НоваяСтрока.RATE_UNIT = Строка.ЕдИзмХарактеристики;
					НоваяСтрока.RATE_VALUE = СтрокаТариф.ТарифЗаЕдХарактеристики;
				КонецЕсли;
			КонецЕсли;				
		КонецЦикла;
		Сч = Сч - 1;
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("Услуга");
	Результат.Колонки.Удалить("Здание");
	Результат.Колонки.Удалить("Характеристика");
	Результат.Колонки.Удалить("ЕдИзмХарактеристики");
	Результат.Свернуть("ACCOUNT_CODE,PROVIDER_CODE,SERVICE_CODE,FEATURE_CODE,RATE_TYPE,RATE_UNIT,RATE_VALUE");
	Возврат Результат;
КонецФункции

Функция getNorms(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА
		|			ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ПУГарячаяВода
	    |				КОГДА ИСТИНА ТОГДА ""water.sewerage.hot""
	    |				ИНАЧЕ ""water.sewerage.cold""
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_CODE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА 
	    |			ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ЕдиницаИзмерения.Наименование
	    |				КОГДА ""м3"" ТОГДА ""m3""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_UNIT,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""residentsNumber""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""residentsNumber""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК FEATURE_CODE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""pp""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""pp""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК FEATURE_UNIT,
	    |	НЕОПРЕДЕЛЕНО КАК NORM_VALUE,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
		|	НазначенныеУслугиСрезПоследних.Услуга КАК Услуга
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(, Действует" + Условие + ") КАК НазначенныеУслугиСрезПоследних
		|ГДЕ
		|	НазначенныеУслугиСрезПоследних.Услуга.СпособНачисления = Значение(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления)";
	Результат = Запрос.Выполнить().Выгрузить();
	ЗапросНорма = Новый Запрос;
	ЗапросНорма.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР ТарифыСрезПоследних.НормаПотребления
		|		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТарифыСрезПоследних.НормаПотребления
		|	КОНЕЦ КАК NORM_VALUE
		|ИЗ
		|	РегистрСведений.Тарифы.СрезПоследних(, Услуга = &Услуга И Здание = &Здание) КАК ТарифыСрезПоследних";
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		ЗапросНорма.УстановитьПараметр("Здание", Строка.Здание);
		ЗапросНорма.УстановитьПараметр("Услуга", Строка.Услуга);
		РезультатНорма = ЗапросНорма.Выполнить().Выгрузить();
		Для каждого СтрокаНорма из РезультатНорма Цикл
			Строка.NORM_VALUE = СтрокаНорма.NORM_VALUE;
		КонецЦикла;
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("Услуга");
	Результат.Колонки.Удалить("Здание");
	Возврат Результат;
КонецФункции

Функция getBalances(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = "РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""water""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК INDUSTRY_TYPE,
	    |	ГОД(РасчетыПоЛицевымСчетам.Период) КАК PERIOD_YEAR,
	    |	МЕСЯЦ(РасчетыПоЛицевымСчетам.Период) КАК PERIOD_MONTH,
	    |	СУММА(ВЫБОР
	    |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|				ТИП(Документ.ВводНачальныхОстатков),
		|				ТИП(Документ.ВводНачальныхОстатковПоЛС))
		|			ТОГДА
		|				ВЫБОР РасчетыПоЛицевымСчетам.ВидДвижения
		|					КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА  РасчетыПоЛицевымСчетам.Сумма
	    |					ИНАЧЕ  -РасчетыПоЛицевымСчетам.Сумма
		|				КОНЕЦ
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК CALC_START,
	    |	СУММА(ВЫБОР
	    |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|				ТИП(Документ.НачислениеПоЛС),
		|				ТИП(Документ.РазовоеНачислениеУслуг),
		|				ТИП(Документ.РаспределениеДополнительныхНачислений),
		|				ТИП(Документ.КорректировкаНачислений))
	    |			ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК CALC_ACCRUAL,
	    |	СУММА(ВЫБОР
	    |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|				ТИП(Документ.НачислениеПениПоЛС))
	    |			ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК CALC_PENALTY,
	    |	0.0 КАК CALC_BENEFIT,
	    |	СУММА(ВЫБОР
	    |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|				ТИП(Документ.ОплатаУслугМВК),
		|				ТИП(Документ.ПоступлениеНаСчет),
		|				ТИП(Документ.ПоступлениеВКассу),
		|				ТИП(Документ.ВозвратИзКассы),
		|				ТИП(Документ.ЧекККМ),
		|				ТИП(Документ.ЧекККМВозврат),
		|				ТИП(Документ.КорректировкаДолга))
		|			И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия) ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК CALC_PAYMENT,
	    |	СУММА(ВЫБОР
	    |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|				ТИП(Документ.ПоступлениеНаСчет))
	    |			И РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия) ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК CALC_SUBSIDY,
	    |	СУММА(ВЫБОР
	    |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|				ТИП(Документ.ПерерасчетПоЛС),
		|				ТИП(Документ.АктСверки),
		|				ТИП(Документ.ДоговорРеструктуризацииДолга),
		|				ТИП(Документ.КорректировкаРегистров))
	    |			ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |			ИНАЧЕ 0
	    |		КОНЕЦ) КАК CALC_RECALC,
		|	0.0 КАК CALC_INVOICE,
		|	0.0 КАК CALC_FINISH,
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	" + Условие + "Активность
		|	И РасчетыПоЛицевымСчетам.Сумма <> 0
	    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ЗакрытиеМесяца) 
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	    |	ГОД(РасчетыПоЛицевымСчетам.Период),
	    |	МЕСЯЦ(РасчетыПоЛицевымСчетам.Период),
	    |	РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""water""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет,
	    |	PERIOD_YEAR,
	    |	PERIOD_MONTH";
	Результат = Запрос.Выполнить().Выгрузить();
	ПредыдущийЛС = Справочники.ЛицевыеСчета.ПустаяСсылка();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Если Строка.ЛицевойСчет <> ПредыдущийЛС Тогда
			ПредыдущийЛС = Строка.ЛицевойСчет;
			КонечныйБаланс = Строка.CALC_START-Строка.CALC_RECALC;
		Иначе
			Строка.CALC_START = КонечныйБаланс;
			КонечныйБаланс = КонечныйБаланс 
			    +Строка.CALC_RECALC
				+Строка.CALC_ACCRUAL
				+Строка.CALC_PENALTY
				-Строка.CALC_PAYMENT
				-Строка.CALC_BENEFIT
				-Строка.CALC_SUBSIDY; 
		КонецЕсли;
		Строка.CALC_INVOICE = КонечныйБаланс;
		Строка.CALC_FINISH  = КонечныйБаланс;
	КонецЦикла;
	Сч = Результат.Количество()-1;
	Пока Сч >=0 Цикл
		Строка = Результат.Получить(Сч);
		Если КонецМесяца(Дата(Строка.PERIOD_YEAR, Строка.PERIOD_MONTH, 1)) < Дата("20200501000000") Тогда
			Результат.Удалить(Сч);
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла; 
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции	

Функция getConsumpts(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = "РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА
	    |			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ПУГарячаяВода
	    |				КОГДА ИСТИНА ТОГДА ""water.sewerage.hot""
	    |				ИНАЧЕ ""water.sewerage.cold""
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_CODE,
	    |	ГОД(РасчетыПоЛицевымСчетам.МесяцНачисления) КАК PERIOD_YEAR,
	    |	МЕСЯЦ(РасчетыПоЛицевымСчетам.МесяцНачисления) КАК PERIOD_MONTH,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""m3""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК CONSUMPT_UNIT,
	    |	СУММА(РасчетыПоЛицевымСчетам.Количество) КАК CONSUMPT_VOLUME,
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	" + Условие + "Активность
		|	И РасчетыПоЛицевымСчетам.Количество <> 0
	    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) НЕ В (
		|		ТИП(Документ.ЗакрытиеМесяца), 
		|		ТИП(Документ.ВводНачальныхОстатков), 
		|		ТИП(Документ.ВводНачальныхОстатковПоЛС)
		|	)
	    |	И НЕ (
		|		ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
		|		И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
		|	)	
	    |	И РасчетыПоЛицевымСчетам.Услуга.ВидУслуги В (
	    |		ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода),
	    |		ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение)
	    |   )
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	    |	ГОД(РасчетыПоЛицевымСчетам.МесяцНачисления),
	    |	МЕСЯЦ(РасчетыПоЛицевымСчетам.МесяцНачисления),
	    |	РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА
	    |			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ПУГарячаяВода
	    |				КОГДА ИСТИНА ТОГДА ""water.sewerage.hot""
	    |				ИНАЧЕ ""water.sewerage.cold""
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""m3""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ";                                     	
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции	

Функция getFinances(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = "РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА
	    |			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ПУГарячаяВода
	    |				КОГДА ИСТИНА ТОГДА ""water.sewerage.hot""
	    |				ИНАЧЕ ""water.sewerage.cold""
	    |			КОНЕЦ
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Дополнительные) ТОГДА ""water.subsfee.total""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_CODE,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА
	    |			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения.Наименование
	    |				КОГДА ""м3"" ТОГДА ""m3""
	    |				КОГДА ""грн"" ТОГДА ""s""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_UNIT,
	    |	ВЫБОР
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.НачислениеПоЛС))
		|		И РасчетыПоЛицевымСчетам.Услуга.СпособНачисления В (
		|			ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления))
	    |		ТОГДА
	    |			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ВидУслуги
	    |				КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""residentsNumber""
	    |				КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""residentsNumber""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК FEATURE_CODE,
	    |	ВЫБОР
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.НачислениеПоЛС))
		|		И РасчетыПоЛицевымСчетам.Услуга.СпособНачисления В (
		|			ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления))
	    |		ТОГДА
	    |			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.ВидУслуги
	    |				КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""pp""
	    |				КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""pp""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК FEATURE_UNIT,
	    |	НЕОПРЕДЕЛЕНО КАК FEATURE_VALUE,
	    |	НЕОПРЕДЕЛЕНО КАК NORM_VALUE,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Тариф
	    |		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ
		|			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.СпособНачисления
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ФиксированноеНачисление) ТОГДА ""fixed""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета) ТОГДА ""service""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоРасчетнымЗначениям) ТОГДА ""service""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления) ТОГДА ""service""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |	КОНЕЦ КАК RATE_TYPE,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Тариф
	    |		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ
		|			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.СпособНачисления
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета) ТОГДА ""m3""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоРасчетнымЗначениям) ТОГДА ""m3""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления) ТОГДА ""m3""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |	КОНЕЦ КАК RATE_UNIT,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Тариф
	    |		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ РасчетыПоЛицевымСчетам.Тариф
	    |	КОНЕЦ КАК RATE_VALUE,
	    |	ГОД(РасчетыПоЛицевымСчетам.Период) КАК PERIOD_CURRENT_YEAR,
	    |	МЕСЯЦ(РасчетыПоЛицевымСчетам.Период) КАК PERIOD_CURRENT_MONTH,
		|	ВЫБОР РасчетыПоЛицевымСчетам.МесяцНачисления
	    |		КОГДА ДАТАВРЕМЯ(1, 1, 1) ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ ГОД(РасчетыПоЛицевымСчетам.МесяцНачисления)
	    |	КОНЕЦ КАК PERIOD_ACCOUNT_YEAR,
		|	ВЫБОР РасчетыПоЛицевымСчетам.МесяцНачисления
	    |		КОГДА ДАТАВРЕМЯ(1, 1, 1) ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ МЕСЯЦ(РасчетыПоЛицевымСчетам.МесяцНачисления)
	    |	КОНЕЦ КАК PERIOD_ACCOUNT_MONTH,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.ДатаНачалаПериода
	    |		КОГДА ДАТАВРЕМЯ(1, 1, 1) ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ РасчетыПоЛицевымСчетам.ДатаНачалаПериода
	    |	КОНЕЦ КАК PERIOD_ACCOUNT_START,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.ДатаОкончанияПериода
	    |		КОГДА ДАТАВРЕМЯ(1, 1, 1) ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ РасчетыПоЛицевымСчетам.ДатаОкончанияПериода
	    |	КОНЕЦ КАК PERIOD_ACCOUNT_FINISH,
	    |	ВЫБОР
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.НачислениеПоЛС))
	    |		ТОГДА ""accrual""
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.НачислениеПениПоЛС))
	    |		ТОГДА ""penalty""
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.ПоступлениеНаСчет))
	    |		И РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	    |		ТОГДА ""subsidy""
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.ОплатаУслугМВК),
		|			ТИП(Документ.ПоступлениеНаСчет), 
		|			ТИП(Документ.КорректировкаДолга))
	    |		И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	    |		ТОГДА ""payment""
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.ПерерасчетПоЛС), 
		|			ТИП(Документ.АктСверки), 
		|			ТИП(Документ.КорректировкаНачислений), 
		|			ТИП(Документ.КорректировкаРегистров))
	    |		ТОГДА ""recalc""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК CALC_TYPE,
	    |	ВЫБОР
	    |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|			ТИП(Документ.НачислениеПоЛС))
	    |		ТОГДА
		|			ВЫБОР РасчетыПоЛицевымСчетам.Услуга.СпособНачисления
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ФиксированноеНачисление) ТОГДА ""fixed""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоРасчетнымЗначениям) ТОГДА ""common""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета) ТОГДА ""indication""
	    |				КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления) ТОГДА ""normative""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК CALC_METHOD,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.Количество
	    |		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ РасчетыПоЛицевымСчетам.Количество
	    |	КОНЕЦ КАК CALC_VOLUME,
	    |	ВЫБОР РасчетыПоЛицевымСчетам.ДнейНачислено
	    |		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ РасчетыПоЛицевымСчетам.ДнейНачислено
	    |	КОНЕЦ КАК CALC_INTERVAL,
	    |	РасчетыПоЛицевымСчетам.Сумма КАК CALC_CSUM,
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
	    |	РасчетыПоЛицевымСчетам.Услуга КАК Услуга
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	" + Условие + "РасчетыПоЛицевымСчетам.Активность
		|	И РасчетыПоЛицевымСчетам.Сумма <> 0
	    |	И НЕ ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) В (
		|		ТИП(Документ.ЗакрытиеМесяца), 
		|		ТИП(Документ.ВводНачальныхОстатков), 
		|		ТИП(Документ.ВводНачальныхОстатковПоЛС)
		|	)
	    |	И НЕ (
		|		ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
		|		И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
		|	)";	
	Результат = Запрос.Выполнить().Выгрузить();
	ЗапросХарактеристикаНорма = Новый Запрос;
	ЗапросХарактеристикаНорма.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
		|		КОГДА 0 ТОГДА 1
		|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
		|	КОНЕЦ КАК FEATURE_VALUE,
		|	ВЫБОР ТарифыСрезПоследних.НормаПотребления
		|		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ТарифыСрезПоследних.НормаПотребления, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК NORM_VALUE,
		|	ВЫБОР ТарифыСрезПоследних.ЗначениеТарифаПоНорме
		|		КОГДА 0 ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифаПоНорме, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК RATE_VALUE
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&НаДату, Здание = &Здание И Услуга = &Услуга) КАК ТарифыСрезПоследних
		|		ПО ИСТИНА";
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Если Строка.FEATURE_CODE <> Неопределено Тогда
			ЗапросХарактеристикаНорма.УстановитьПараметр("ЛицевойСчет", Строка.ЛицевойСчет);
			ЗапросХарактеристикаНорма.УстановитьПараметр("Здание", 		Строка.Здание);
			ЗапросХарактеристикаНорма.УстановитьПараметр("Услуга", 		Строка.Услуга);
			ЗапросХарактеристикаНорма.УстановитьПараметр("НаДату", 		?(Строка.PERIOD_ACCOUNT_FINISH <> Неопределено, Строка.PERIOD_ACCOUNT_FINISH, КонецМесяца(Дата(Строка.PERIOD_ACCOUNT_YEAR, Строка.PERIOD_ACCOUNT_MONTH, 1))));
			РезультатХарактеристикаНорма = ЗапросХарактеристикаНорма.Выполнить().Выгрузить();
			Для каждого СтрокаХарактеристикаНорма из РезультатХарактеристикаНорма Цикл
				Строка.FEATURE_VALUE = СтрокаХарактеристикаНорма.FEATURE_VALUE;
				Строка.NORM_VALUE = СтрокаХарактеристикаНорма.NORM_VALUE;
				Если СтрокаХарактеристикаНорма.NORM_VALUE = Неопределено
				   И СтрокаХарактеристикаНорма.FEATURE_VALUE <> Неопределено 
				   И СтрокаХарактеристикаНорма.RATE_VALUE <> Неопределено Тогда
					Строка.CALC_METHOD = "feature";
					Строка.RATE_VALUE = СтрокаХарактеристикаНорма.RATE_VALUE;
					Строка.RATE_UNIT = Строка.FEATURE_UNIT;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("Здание");
	Результат.Колонки.Удалить("Услуга");
	Результат.Свернуть(
		"ACCOUNT_CODE,PROVIDER_CODE,SERVICE_CODE,SERVICE_UNIT,
		|FEATURE_CODE,FEATURE_UNIT,FEATURE_VALUE,NORM_VALUE,RATE_TYPE,RATE_UNIT,RATE_VALUE,
		|PERIOD_CURRENT_YEAR,PERIOD_CURRENT_MONTH,
		|PERIOD_ACCOUNT_YEAR,PERIOD_ACCOUNT_MONTH,PERIOD_ACCOUNT_START,PERIOD_ACCOUNT_FINISH,
		|CALC_TYPE,CALC_METHOD,CALC_INTERVAL",
		"CALC_VOLUME,CALC_CSUM"
	);
	Возврат Результат;
КонецФункции	

Функция getPayments(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = "ОплатаУслугМВК.ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	ГОД(ОплатаУслугМВК.Дата) КАК PERIOD_YEAR,
	    |	МЕСЯЦ(ОплатаУслугМВК.Дата) КАК PERIOD_MONTH,
		|	ОплатаУслугМВК.Номер КАК PAYMENT_CODE,
	    |	ЕСТЬNULL(
		|		ВЫБОР ОплатаУслугМВК.ДатаВходящегоДокумента
		|			КОГДА ДАТАВРЕМЯ(1, 1, 1) ТОГДА NULL
		|			ИНАЧЕ ОплатаУслугМВК.ДатаВходящегоДокумента 
		|		КОНЕЦ,
		|		ОплатаУслугМВК.Дата
		|	) КАК PAYMENT_DATE,
	    |	ОплатаУслугМВК.СуммаПлатежа КАК PAYMENT_CSUM,
	    |	ОплатаУслугМВК.БанковскийСчет.Банк.Представление КАК PAYMENT_AGENT,
	    |	ОплатаУслугМВК.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	Документ.ОплатаУслугМВК КАК ОплатаУслугМВК
	    |ГДЕ
	    |	" + Условие + "ОплатаУслугМВК.Проведен
		|	И НЕ ОплатаУслугМВК.ЛицевойСчет.ПометкаУдаления";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции	

Функция getMeters(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = " И ОбъектУстановки = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	ВЫБОР УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""water""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК GROUP_TYPE,
	    |	НЕОПРЕДЕЛЕНО КАК METER_CODE,
	    |	ВЫБОР УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""water.hot""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК METER_TYPE,
	    |	ВЫБОР УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер
	    |		КОГДА """" ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер
	    |	КОНЕЦ КАК METER_SERIAL,
	    |	ВЫБОР УстановленныеПриборыУчетаСрезПоследних.ТипПрибора
	    |		КОГДА """" ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ УстановленныеПриборыУчетаСрезПоследних.ТипПрибора
	    |	КОНЕЦ КАК METER_MODEL,
	    |	ВЫБОР УстановленныеПриборыУчетаСрезПоследних.МестоРазмещения
	    |		КОГДА """" ТОГДА НЕОПРЕДЕЛЕНО
	    |		ИНАЧЕ УстановленныеПриборыУчетаСрезПоследних.МестоРазмещения
	    |	КОНЕЦ КАК METER_PLACE,
	    |	УстановленныеПриборыУчетаСрезПоследних.ДатаПоследнейПоверки КАК METER_CONFIRMED,
	    |	УстановленныеПриборыУчетаСрезПоследних.ДатаСледующейПоверки КАК METER_NCONFIRMD,
	    |	ВЫБОР УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.cold.consumption""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""water.hot.consumption""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК INDICATOR_TYPE,
	    |	ВЫБОР УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560""
	    |			ТОГДА ВЫБОР УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЕдиницаИзмерения.Наименование
	    |				КОГДА ""м3"" ТОГДА ""m3""
	    |				ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК INDICATOR_UNIT,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент КАК INDICATOR_COEFFICIENT,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(, Действует" + Условие + " И НЕ ПриборУчета.ОбщедомовойСчетчик) КАК УстановленныеПриборыУчетаСрезПоследних";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.METER_CODE   = Строка(Строка.ПриборУчета.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("ПриборУчета");
	Возврат Результат;
КонецФункции

Функция getSeals(CODE) Экспорт
	Возврат Новый ТаблицаЗначений();
КонецФункции

Функция getIndications(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		Условие = "";
	Иначе
		Условие = "ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	ВЫБОР ПоказанияПриборовЗаМесяц.Услуга.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""water""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК GROUP_TYPE,
	    |	ВЫБОР ТИПЗНАЧЕНИЯ(ПоказанияПриборовЗаМесяц.Регистратор)
	    |		КОГДА ТИП(Документ.ВводПоказанийПриборовЗаМесяц) ТОГДА ""normal""
	    |		КОГДА ТИП(Документ.АктСверки) ТОГДА ""trusted""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК PACKAGE_TYPE,
	    |	НАЧАЛОПЕРИОДА(ПоказанияПриборовЗаМесяц.Период, ДЕНЬ) КАК PACKAGE_INDICATED,
	    |	НЕОПРЕДЕЛЕНО КАК INDICATOR_CODE,
	    |	МИНИМУМ(ПоказанияПриборовЗаМесяц.ПоказаниеПредыдущее) КАК INDICATION_PREV,
	    |	МАКСИМУМ(ПоказанияПриборовЗаМесяц.Показание) КАК INDICATION_CURR,
	    |	ПоказанияПриборовЗаМесяц.ЛицевойСчет КАК ЛицевойСчет,
	    |	ПоказанияПриборовЗаМесяц.ПриборУчета КАК ПриборУчета
	    |ИЗ
	    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
	    |ГДЕ
	    |	" + Условие + "НЕ ПоказанияПриборовЗаМесяц.ПриборУчета.ОбщедомовойСчетчик
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ПоказанияПриборовЗаМесяц.ЛицевойСчет,
	    |	ПоказанияПриборовЗаМесяц.ПриборУчета,
	    |	НАЧАЛОПЕРИОДА(ПоказанияПриборовЗаМесяц.Период, ДЕНЬ),
	    |	ВЫБОР ПоказанияПриборовЗаМесяц.Услуга.Организация.КодПоЕДРПОУ
	    |		КОГДА ""03362560"" ТОГДА ""water""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ,
	    |	ВЫБОР ТИПЗНАЧЕНИЯ(ПоказанияПриборовЗаМесяц.Регистратор)
	    |		КОГДА ТИП(Документ.ВводПоказанийПриборовЗаМесяц) ТОГДА ""normal""
	    |		КОГДА ТИП(Документ.АктСверки) ТОГДА ""trusted""
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE   = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.INDICATOR_CODE = Строка(Строка.ПриборУчета.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("ПриборУчета");
	Возврат Результат;
КонецФункции

Функция getISRels(CODE) Экспорт
	Запрос = Новый Запрос;
	Если CODE = Null Или CODE = Неопределено Или CODE = "" Тогда
		УсловиеУслуга 	   = "";
		УсловиеПриборУчета = "";
	Иначе
		УсловиеУслуга 	   = " И ЛицевойСчет = &ЛицевойСчет";
		УсловиеПриборУчета = " И ОбъектУстановки = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	    |	НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	    |	ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.supply.cold""
	    |		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА 
	    |			ВЫБОР НазначенныеУслугиСрезПоследних.Услуга.ПУГарячаяВода
	    |				КОГДА ИСТИНА ТОГДА ""water.sewerage.hot""
	    |				ИНАЧЕ ""water.sewerage.cold""
	    |			КОНЕЦ
	    |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	    |	КОНЕЦ КАК SERVICE_CODE,
	    |	НЕОПРЕДЕЛЕНО КАК INDICATOR_CODE,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(, Действует" + УсловиеУслуга + ") КАК НазначенныеУслугиСрезПоследних
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(, Действует" + УсловиеПриборУчета + " И НЕ ПриборУчета.ОбщедомовойСчетчик) КАК УстановленныеПриборыУчетаСрезПоследних
	    |		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки И		
		|			НазначенныеУслугиСрезПоследних.Организация.КодПоЕДРПОУ = ""03362560"" И (
	    |				НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги = ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода)
	    |				И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги = ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода)
	    |			ИЛИ НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги = ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение)
	    |				И НЕ НазначенныеУслугиСрезПоследних.Услуга.ПУГарячаяВода
	    |				И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги = ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода)
	    |			ИЛИ НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги = ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение)
	    |				И НазначенныеУслугиСрезПоследних.Услуга.ПУГарячаяВода
	    |				И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги = ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение)
		|			)";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Результат Цикл
		Строка.ACCOUNT_CODE   = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.INDICATOR_CODE = Строка(Строка.ПриборУчета.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("ПриборУчета");
	Возврат Результат;
КонецФункции

Функция putCCEs(DATA) Экспорт
	Возврат ПустойОтвет();
КонецФункции

Функция putIPEs(DATA) Экспорт
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("ACCOUNT_CODE");
	Результат.Колонки.Добавить("PACKAGE_CODE");
	Пакет = "";
	Для каждого Строка Из DATA Цикл
		ЛицевойСчет = ЛицевойСчетПоGUID(Строка.ACCOUNT_CODE);
		ПриборУчета = ПриборУчетаПоGUID(Строка.INDICATOR_CODE);
		НаборЗаписей = РегистрыСведений.ПоказанияПриборовУчетаССайта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЛицевойСчет.Установить(ЛицевойСчет);
		НаборЗаписей.Отбор.ПриборУчета.Установить(ПриборУчета);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());		
		НовСтрока = НаборЗаписей.Добавить();
		НовСтрока.ЛицевойСчет 		  = ЛицевойСчет;
		НовСтрока.ПриборУчета 		  = ПриборУчета;
		НовСтрока.Значение 	  		  = Строка.INDICATION_CURR;
		НовСтрока.ПоказаниеПредыдущее = Строка.INDICATION_PREV;
		НовСтрока.Услуга 			  = Справочники.Услуги.НайтиПоКоду(?(Строка.INDICATOR_TYPE = "water.cold.consumption", "000000048", "000000020"));
		НовСтрока.ВидТарифа   		  = Перечисления.ВидыТарифов.Общий;
		НовСтрока.Период 	  		  = ТекущаяДата();
		НовСтрока.Активность  		  = Истина;		
		Если Строка.PACKAGE_CODE <> Пакет Тогда
			Запись = Результат.Добавить();
			Запись.ACCOUNT_CODE = Строка.ACCOUNT_CODE;
			Запись.PACKAGE_CODE = Строка.PACKAGE_CODE;
			Пакет = Строка.PACKAGE_CODE;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;	
	Возврат Результат;
КонецФункции

Функция putNDEs(DATA) Экспорт
	Возврат ПустойОтвет();
КонецФункции

Функция putMDFs(DATA) Экспорт
	Возврат ПустойОтвет();
КонецФункции
